## Production: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-us-west-2-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-sms-phone-carrier-unavailable-us-west-2-warning" {
      ~ alarm_description         = "More than 10 SMS failed because a phone carrier is unavailable over 6 hours" -> "More than 100 SMS failed because a phone carrier is unavailable over 3 hours"
        id                        = "sns-sms-phone-carrier-unavailable-us-west-2-warning"
      ~ period                    = 21600 -> 10800
        tags                      = {}
      ~ threshold                 = 10 -> 100
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sns-sms-phone-carrier-unavailable-warning" {
      ~ alarm_description         = "More than 10 SMS failed because a phone carrier is unavailable over 6 hours" -> "More than 100 SMS failed because a phone carrier is unavailable over 3 hours"
        id                        = "sns-sms-phone-carrier-unavailable-warning"
      ~ period                    = 21600 -> 10800
        tags                      = {}
      ~ threshold                 = 10 -> 100
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-db-tasks-stuck-in-queue-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in DB tasks queue is older than 1 minute for 10 minutes"
      + alarm_name                            = "sqs-db-tasks-stuck-in-queue-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-cadatabase-tasks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 10
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 600
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-db-tasks-stuck-in-queue-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in DB tasks queue is older than 1 minute in a 5-minute period"
      + alarm_name                            = "sqs-db-tasks-stuck-in-queue-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-cadatabase-tasks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2386044973478336261" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1642087399496202000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5841098151388019432" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1642087393230165000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "531237160719224762" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1642087399308465000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
            # (1 unchanged element hidden)
        }
    }

Plan: 5 to add, 2 to change, 3 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>